Platform/app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    @post.customer = @current_customer
    if @post.save
---
INSERT INTO `posts` (`title`, `body`, `created_at`, `updated_at`) VALUES ('First Post', '<p>aLorem ipsum dolor sit amet, consectetur adipiscing elit. Traditur, inquit, ab Epicuro ratio neglegendi doloris. Nam, ut sint illa vendibiliora, haec uberiora certe sunt. Cupiditates non Epicuri divisione finiebat, sed sua satietate. Duo Reges: constructio interrete. Eadem nunc mea adversum te oratio est. Summum en&iacute;m bonum exposuit vacuitatem doloris; Verba tu fingas et ea dicas, quae non sentias? Aliter homines, aliter philosophos loqui putas oportere? His singulis copiose responderi solet, sed quae perspicua sunt longa esse non debent. Non quam nostram quidem, inquit Pomponius iocans; Quippe: habes enim a rhetoribus;</p>\r\n', '2016-11-19 15:17:21', '2016-11-19 15:17:21')

  def update
    if @post.update_attributes(post_params)
---
UPDATE `posts` SET `body` = '<p>This post is from customer Two Lorem ipsum dolor sit amet, consectetur adipiscing elit. Hoc sic expositum dissimile est superiori. His enim rebus detractis negat se reperire in asotorum vita quod reprehendat. Negat enim summo bono afferre incrementum diem. Oculorum, inquit Plato, est in nobis sensus acerrimus, quibus sapientiam non cernimus. Bestiarum vero nullum iudicium puto. Quae cum ita sint, effectum est nihil esse malum, quod turpe non sit. Illis videtur, qui illud non dubitant bonum dicere -; Duo Reges: constructio interrete. Sed residamus, inquit, si placet. An vero, inquit, quisquam potest probare, quod perceptfum, quod.</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>Lorem ipsum dolor sit amet, consectetur adipiscing elit. Quae quidem vel cum periculo est quaerenda vobis; Tecum optime, deinde etiam cum mediocri amico.</p>\r\n', `updated_at` = '2016-12-19 18:37:31' WHERE `posts`.`id` = 4

  def destroy
    @post = Post.find(params[:id])
    if @post.present?
      if @post.destroy
---
SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 1 LIMIT 1
DELETE FROM `posts` WHERE `posts`.`id` = 1