Platform/app/controllers/theme_controller.rb

  def update
    if @theme.update_attributes(theme_params)
---
UPDATE `themes` SET `primary_color` = '#d140db', `primary_inverse_color` = '#ffffff', `secondary_font_color` = '#c0c0c0', `updated_at` = '2017-03-05 19:10:50' WHERE `themes`.`id` = 1

  def find_theme
    @theme = Theme.where(customer_id: current_customer.id).first
---
SELECT  `themes`.* FROM `themes` WHERE `themes`.`customer_id` = 1 ORDER BY `themes`.`id` ASC LIMIT 1