Platform/app/views/bio/show.html.erb

SELECT `career_items`.* FROM `career_items` WHERE `career_items`.`bio_id` = 1
---
<h2>Career</h2>
<% @bio.career_items.each do |item| %>