Platform/app/controllers/customer_admins/registrations_controller.rb

SELECT `customers`.* FROM `customers`
---
  def new
    @customers = Customer.all