app/controllers/bio_controller.rb

  def update
    if @bio.update_attributes(bio_params)
---
UPDATE `bios` SET `name` = 'Niall Quinn', `biography` = 'Just some text about the driver, nothing special', `updated_at` = '2017-03-08 12:18:18' WHERE `bios`.`id` = 1

  def find_bio
    @bio = Bio.where(customer_id: current_customer.id).first
    #Every customer should have one bio
    if !@bio.present?
      puts "inside"
      @bio = Bio.new(:customer_id => current_customer.id)
      @bio.save
---
SELECT  `bios`.* FROM `bios` WHERE `bios`.`customer_id` = 1 ORDER BY `bios`.`id` ASC LIMIT 1
INSERT INTO `bios` (`customer_id`, `created_at`, `updated_at`) VALUES (1, '2017-04-14 11:16:05', '2017-04-14 11:16:05')