app/controllers/events_controller.rb

INSERT INTO `events` (`name`, `caption`, `date`, `image`, `created_at`, `updated_at`, `customer_id`) VALUES ('Silverstone', 'Round 1', '2017-04-14', 'Niall_Quinn__1_.jpg', '2017-04-01 09:53:07', '2017-04-01 09:53:07', 1)
---
  def create
    @event = Event.new(event_params)
    @event.customer = @current_customer
    respond_to do |format|
      if @event.save

UPDATE `events` SET `name` = 'Silverstone', `updated_at` = '2017-04-01 11:57:41' WHERE `events`.`id` = 2
---
  def update
    respond_to do |format|
      if @event.update(event_params)