app/controllers/media_items_controller.rb

INSERT INTO `media_items` (`customer_id`, `created_at`, `updated_at`, `image`, `caption`) VALUES (1, '2017-02-18 10:53:17', '2017-02-18 10:53:17', 'coffee.png', 'Hello!')
---
  def create
    @media_item = MediaItem.new(media_item_params)
    @media_item.customer = @current_customer
    respond_to do |format|
      if @media_item.save

DELETE FROM `media_items` WHERE `media_items`.`id` = 4
---
  def destroy
    @media_item.destroy

SELECT  `media_items`.* FROM `media_items` WHERE `media_items`.`id` = 4 LIMIT 1
---
    def set_media_item
      @media_item = MediaItem.find(params[:id])